ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_spi.cpp
/**
  ******************************************************************************
  * @file    stm32f10x_spi.c
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    11-March-2011
  * @brief   This file provides all the SPI firmware functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_rcc.h"
#include "stm32f10x_spi.h"
uint16_t SPI_I2S_Base::ObjectNum[3] = {0,0,0};
/** @addtogroup STM32F10x_StdPeriph_Driver
  * @{
  */

/** @defgroup SPI
  * @brief SPI driver modules
  * @{
  */

/** @defgroup SPI_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */


/** @defgroup SPI_Private_Defines
  * @{
  */

/* SPI SPE mask */
#define CR1_SPE_Set          ((uint16_t)0x0040)
#define CR1_SPE_Reset        ((uint16_t)0xFFBF)

/* I2S I2SE mask */
#define I2SCFGR_I2SE_Set     ((uint16_t)0x0400)
#define I2SCFGR_I2SE_Reset   ((uint16_t)0xFBFF)

/* SPI CRCNext mask */
#define CR1_CRCNext_Set      ((uint16_t)0x1000)

/* SPI CRCEN mask */
#define CR1_CRCEN_Set        ((uint16_t)0x2000)
#define CR1_CRCEN_Reset      ((uint16_t)0xDFFF)

/* SPI SSOE mask */
#define CR2_SSOE_Set         ((uint16_t)0x0004)
#define CR2_SSOE_Reset       ((uint16_t)0xFFFB)

/* SPI registers Masks */
#define CR1_CLEAR_Mask       ((uint16_t)0x3040)
#define I2SCFGR_CLEAR_Mask   ((uint16_t)0xF040)

/* SPI or I2S mode selection masks */
#define SPI_Mode_Select      ((uint16_t)0xF7FF)
#define I2S_Mode_Select      ((uint16_t)0x0800)

/* I2S clock source selection masks */
#define I2S2_CLOCK_SRC       ((uint32_t)(0x00020000))
#define I2S3_CLOCK_SRC       ((uint32_t)(0x00040000))
#define I2S_MUL_MASK         ((uint32_t)(0x0000F000))
#define I2S_DIV_MASK         ((uint32_t)(0x000000F0))

/**
  * @}
  */

/** @defgroup SPI_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup SPI_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup SPI_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */


SPI::SPI(SPI_TypeDef* _SPIx, InitTypeDef& InitStruct) :SPI_I2S_Base(_SPIx)
{
	this->Init(InitStruct);
	this->On();
}

SPI::SPI(SPI_TypeDef* _SPIx, uint16_t BaudRatePrescaler, uint16_t CPOL, uint16_t CPHA, uint16_t Direction, uint16_t Mode, uint16_t DataSize, uint16_t FirstBit, uint16_t CRCPolynomial, uint16_t NSS) :SPI_I2S_Base(_SPIx)
{
	SPI::InitTypeDef aaa;
	aaa.Direction = Direction;
	aaa.Mode = Mode;
	aaa.DataSize = DataSize;
	aaa.CPOL = CPOL;
	aaa.CPHA = CPHA;
	aaa.NSS = NSS;
	aaa.BaudRatePrescaler = BaudRatePrescaler;
	aaa.FirstBit = FirstBit;
	aaa.CRCPolynomial = CRCPolynomial;
	this->Init(aaa);
	this->On();
}

SPI::SPI(const SPI& Other):SPI_I2S_Base(Other.SPIx)
{
	this->Increase();
}

void SPI::On()
{
	this->Cmd(ENABLE);
}

void SPI::Off()
{
	this->Cmd(DISABLE);
}

uint16_t SPI::operator<<(uint16_t Data)
{
	while((this->SPIx->SR & SPI_I2S_FLAG_TXE) == RESET);
	this->SPIx->DR = Data;
	while((this->SPIx->SR & SPI_I2S_FLAG_RXNE) == RESET);
	return this->SPIx->DR;
}

SPI& SPI::operator>>(uint16_t& Data)
{
	Data = this->ReceiveData();
	return *this;
}

/** @defgroup SPI_Private_Functions
  * @{
  */
SPI::~SPI()
{
	if(this->Decrease()==0)
	{
		this->Off();
		RCC::ClockCmd(*this,DISABLE);
	}
}
I2S::I2S(SPI_TypeDef* _SPIx, InitTypeDef& InitStruct) :SPI_I2S_Base(_SPIx)
{
	this->Init(InitStruct);
	this->On();
}
I2S::I2S(SPI_TypeDef* _SPIx, uint16_t Mode, uint16_t Standard, uint16_t DataFormat, uint16_t MCLKOutput, uint32_t AudioFreq, uint16_t CPOL) : SPI_I2S_Base(_SPIx)
{
	I2S::InitTypeDef aaa;
	aaa.Mode = Mode;
	aaa.Standard = Standard;
	aaa.DataFormat = DataFormat;
	aaa.MCLKOutput = MCLKOutput;
	aaa.AudioFreq = AudioFreq;
	aaa.CPOL = CPOL;
	this->Init(aaa);
	this->On();
}
I2S::I2S(const I2S& Other):SPI_I2S_Base(Other.SPIx)
{
	this->Increase();
}
void I2S::On()
{
	this->Cmd(ENABLE);
}
void I2S::Off()
{
	this->Cmd(DISABLE);
}
I2S::~I2S()
{
	if(this->Decrease()==0)
	{
		this->Off();
		RCC::ClockCmd(*this,DISABLE);
	}
}
void SPI_I2S_Base::Increase(void)
{
	switch((uint32_t)SPIx)
	{
		case SPI1_BASE:
			ObjectNum[0]++;
			break;
		case SPI2_BASE:
			ObjectNum[1]++;
			break;
		case SPI3_BASE:
			ObjectNum[2]++;
			break;
	}
}
uint16_t SPI_I2S_Base::Decrease(void)
{
	switch((uint32_t)SPIx)
	{
		case SPI1_BASE:
			return --ObjectNum[0];
		case SPI2_BASE:
			return --ObjectNum[1];
		case SPI3_BASE:
			return --ObjectNum[2];
	}
	return 0xFFFF;
}
SPI_I2S_Base::SPI_I2S_Base(const SPI_I2S_Base& Other)
{
	this->SPIx = Other.SPIx;
	this->Increase();
}
SPI_TypeDef* SPI_I2S_Base::GetPeriphPointer(void)
{
	return this->SPIx;
}
/**
  * @brief  Deinitializes the SPIx peripheral registers to their default
  *         reset values (Affects also the I2Ss).
  * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
  * @retval None
  */
void SPI_I2S_Base::DeInit(void)
{
	/* Check the parameters */
	assert_param(IS_SPI_ALL_PERIPH(SPIx));

	if(SPIx == SPI1)
	{
		/* Enable SPI1 reset state */
		RCC::APB2PeriphResetCmd(RCC_APB2Periph_SPI1, ENABLE);
		/* Release SPI1 from reset state */
		RCC::APB2PeriphResetCmd(RCC_APB2Periph_SPI1, DISABLE);
	}
	else if(SPIx == SPI2)
	{
		/* Enable SPI2 reset state */
		RCC::APB1PeriphResetCmd(RCC_APB1Periph_SPI2, ENABLE);
		/* Release SPI2 from reset state */
		RCC::APB1PeriphResetCmd(RCC_APB1Periph_SPI2, DISABLE);
	}
	else
	{
		if(SPIx == SPI3)
		{
			/* Enable SPI3 reset state */
			RCC::APB1PeriphResetCmd(RCC_APB1Periph_SPI3, ENABLE);
			/* Release SPI3 from reset state */
			RCC::APB1PeriphResetCmd(RCC_APB1Periph_SPI3, DISABLE);
		}
	}
}

/**
  * @brief  Initializes the SPIx peripheral according to the specified
  *         parameters in the SPI_InitStruct.
  * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
  * @param  SPI_InitStruct: pointer to a SPI_InitTypeDef structure that
  *         contains the configuration information for the specified SPI peripheral.
  * @retval None
  */
void SPI::Init(InitTypeDef &InitStruct)
{
	uint16_t tmpreg = 0;

	/* check the parameters */
	assert_param(IS_SPI_ALL_PERIPH(SPIx));

