ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_spi.cpp
	/* Check the SPI parameters */
	assert_param(IS_SPI_DIRECTION_MODE(InitStruct.Direction));
	assert_param(IS_SPI_MODE(InitStruct.Mode));
	assert_param(IS_SPI_DATASIZE(InitStruct.DataSize));
	assert_param(IS_SPI_CPOL(InitStruct.CPOL));
	assert_param(IS_SPI_CPHA(InitStruct.CPHA));
	assert_param(IS_SPI_NSS(InitStruct.NSS));
	assert_param(IS_SPI_BAUDRATE_PRESCALER(InitStruct.BaudRatePrescaler));
	assert_param(IS_SPI_FIRST_BIT(InitStruct.FirstBit));
	assert_param(IS_SPI_CRC_POLYNOMIAL(InitStruct.CRCPolynomial));
	RCC::ClockCmd(*this,ENABLE);
	/*---------------------------- SPIx CR1 Configuration ------------------------*/
	/* Get the SPIx CR1 value */
	tmpreg = SPIx->CR1;
	/* Clear BIDIMode, BIDIOE, RxONLY, SSM, SSI, LSBFirst, BR, MSTR, CPOL and CPHA bits */
	tmpreg &= CR1_CLEAR_Mask;
	/* Configure SPIx: direction, NSS management, first transmitted bit, BaudRate prescaler
	   master/salve mode, CPOL and CPHA */
	/* Set BIDImode, BIDIOE and RxONLY bits according to Direction value */
	/* Set SSM, SSI and MSTR bits according to Mode and NSS values */
	/* Set LSBFirst bit according to FirstBit value */
	/* Set BR bits according to BaudRatePrescaler value */
	/* Set CPOL bit according to CPOL value */
	/* Set CPHA bit according to CPHA value */
	tmpreg |= (uint16_t)((uint32_t)InitStruct.Direction | InitStruct.Mode |
	                     InitStruct.DataSize | InitStruct.CPOL |
	                     InitStruct.CPHA | InitStruct.NSS |
	                     InitStruct.BaudRatePrescaler | InitStruct.FirstBit);
	/* Write to SPIx CR1 */
	SPIx->CR1 = tmpreg;

	/* Activate the SPI mode (Reset I2SMOD bit in I2SCFGR register) */
	SPIx->I2SCFGR &= SPI_Mode_Select;

	/*---------------------------- SPIx CRCPOLY Configuration --------------------*/
	/* Write to SPIx CRCPOLY */
	SPIx->CRCPR = InitStruct.CRCPolynomial;
}

/**
  * @brief  Initializes the SPIx peripheral according to the specified
  *         parameters in the I2S_InitStruct.
  * @param  SPIx: where x can be  2 or 3 to select the SPI peripheral
  *         (configured in I2S mode).
  * @param  I2S_InitStruct: pointer to an I2S_InitTypeDef structure that
  *         contains the configuration information for the specified SPI peripheral
  *         configured in I2S mode.
  * @note
  *  The function calculates the optimal prescaler needed to obtain the most
  *  accurate audio frequency (depending on the I2S clock source, the PLL values
  *  and the product configuration). But in case the prescaler value is greater
  *  than 511, the default value (0x02) will be configured instead.  *
  * @retval None
  */
void I2S::Init(InitTypeDef &InitStruct)
{
	uint16_t tmpreg = 0, i2sdiv = 2, i2sodd = 0, packetlength = 1;
	uint32_t tmp = 0;
	RCC_ClocksTypeDef RCC_Clocks;
	uint32_t sourceclock = 0;

	/* Check the I2S parameters */
	assert_param(IS_SPI_23_PERIPH(SPIx));
	assert_param(IS_I2S_MODE(InitStruct.Mode));
	assert_param(IS_I2S_STANDARD(InitStruct.Standard));
	assert_param(IS_I2S_DATA_FORMAT(InitStruct.DataFormat));
	assert_param(IS_I2S_MCLK_OUTPUT(InitStruct.MCLKOutput));
	assert_param(IS_I2S_AUDIO_FREQ(InitStruct.AudioFreq));
	assert_param(IS_I2S_CPOL(InitStruct.CPOL));
	RCC::ClockCmd(*this,ENABLE);
	/*----------------------- SPIx I2SCFGR & I2SPR Configuration -----------------*/
	/* Clear I2SMOD, I2SE, I2SCFG, PCMSYNC, I2SSTD, CKPOL, DATLEN and CHLEN bits */
	SPIx->I2SCFGR &= I2SCFGR_CLEAR_Mask;
	SPIx->I2SPR = 0x0002;

	/* Get the I2SCFGR register value */
	tmpreg = SPIx->I2SCFGR;

	/* If the default value has to be written, reinitialize i2sdiv and i2sodd*/
	if(InitStruct.AudioFreq == I2S_AudioFreq_Default)
	{
		i2sodd = (uint16_t)0;
		i2sdiv = (uint16_t)2;
	}
	/* If the requested audio frequency is not the default, compute the prescaler */
	else
	{
		/* Check the frame length (For the Prescaler computing) */
		if(InitStruct.DataFormat == I2S_DataFormat_16b)
		{
			/* Packet length is 16 bits */
			packetlength = 1;
		}
		else
		{
			/* Packet length is 32 bits */
			packetlength = 2;
		}

		/* Get the I2S clock source mask depending on the peripheral number */
		if(((uint32_t)SPIx) == SPI2_BASE)
		{
			/* The mask is relative to I2S2 */
			tmp = I2S2_CLOCK_SRC;
		}
		else
		{
			/* The mask is relative to I2S3 */
			tmp = I2S3_CLOCK_SRC;
		}

		/* Check the I2S clock source configuration depending on the Device:
		   Only Connectivity line devices have the PLL3 VCO clock */
#ifdef STM32F10X_CL
		if((_RCC->CFGR2 & tmp) != 0)
		{
			/* Get the configuration bits of RCC PLL3 multiplier */
			tmp = (uint32_t)((_RCC->CFGR2 & I2S_MUL_MASK) >> 12);

			/* Get the value of the PLL3 multiplier */
			if((tmp > 5) && (tmp < 15))
			{
				/* Multiplier is between 8 and 14 (value 15 is forbidden) */
				tmp += 2;
			}
			else
			{
				if(tmp == 15)
				{
					/* Multiplier is 20 */
					tmp = 20;
				}
			}
			/* Get the PREDIV2 value */
			sourceclock = (uint32_t)(((_RCC->CFGR2 & I2S_DIV_MASK) >> 4) + 1);

			/* Calculate the Source Clock frequency based on PLL3 and PREDIV2 values */
			sourceclock = (uint32_t)((HSE_Value / sourceclock) * tmp * 2);
		}
		else
		{
			/* I2S Clock source is System clock: Get System Clock frequency */
			RCC_GetClocksFreq(&RCC_Clocks);

			/* Get the source clock value: based on System Clock value */
			sourceclock = RCC_Clocks.SYSCLK_Frequency;
		}
#else /* STM32F10X_HD */
		/* I2S Clock source is System clock: Get System Clock frequency */
		RCC::GetClocksFreq(RCC_Clocks);

		/* Get the source clock value: based on System Clock value */
		sourceclock = RCC_Clocks.SYSCLK_Frequency;
#endif /* STM32F10X_CL */

		/* Compute the Real divider depending on the MCLK output state with a floating point */
		if(InitStruct.MCLKOutput == I2S_MCLKOutput_Enable)
		{
			/* MCLK output is enabled */
			tmp = (uint16_t)(((((sourceclock / 256) * 10) / InitStruct.AudioFreq)) + 5);
		}
		else
		{
			/* MCLK output is disabled */
			tmp = (uint16_t)(((((sourceclock / (32 * packetlength)) *10) / InitStruct.AudioFreq)) + 5);
		}

		/* Remove the floating point */
		tmp = tmp / 10;

		/* Check the parity of the divider */
		i2sodd = (uint16_t)(tmp & (uint16_t)0x0001);

		/* Compute the i2sdiv prescaler */
		i2sdiv = (uint16_t)((tmp - i2sodd) / 2);

		/* Get the Mask for the Odd bit (SPI_I2SPR[8]) register */
		i2sodd = (uint16_t)(i2sodd << 8);
	}

