ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_spi.cpp
	/* Test if the divider is 1 or 0 or greater than 0xFF */
	if((i2sdiv < 2) || (i2sdiv > 0xFF))
	{
		/* Set the default values */
		i2sdiv = 2;
		i2sodd = 0;
	}

	/* Write to SPIx I2SPR register the computed value */
	SPIx->I2SPR = (uint16_t)(i2sdiv | (uint16_t)(i2sodd | (uint16_t)InitStruct.MCLKOutput));

	/* Configure the I2S with the SPI_InitStruct values */
	tmpreg |= (uint16_t)(I2S_Mode_Select | (uint16_t)(InitStruct.Mode | \
	                     (uint16_t)(InitStruct.Standard | (uint16_t)(InitStruct.DataFormat | \
	                                (uint16_t)InitStruct.CPOL))));

	/* Write to SPIx I2SCFGR */
	SPIx->I2SCFGR = tmpreg;
}

/**
  * @brief  Fills each SPI_InitStruct member with its default value.
  * @param  SPI_InitStruct : pointer to a SPI_InitTypeDef structure which will be initialized.
  * @retval None
  */
void SPI::StructInit(InitTypeDef &InitStruct)
{
	/*--------------- Reset SPI init structure parameters values -----------------*/
	/* Initialize the Direction member */
	InitStruct.Direction = SPI_Direction_2Lines_FullDuplex;
	/* initialize the Mode member */
	InitStruct.Mode = SPI_Mode_Slave;
	/* initialize the DataSize member */
	InitStruct.DataSize = SPI_DataSize_8b;
	/* Initialize the CPOL member */
	InitStruct.CPOL = SPI_CPOL_Low;
	/* Initialize the CPHA member */
	InitStruct.CPHA = SPI_CPHA_1Edge;
	/* Initialize the NSS member */
	InitStruct.NSS = SPI_NSS_Hard;
	/* Initialize the BaudRatePrescaler member */
	InitStruct.BaudRatePrescaler = SPI_BaudRatePrescaler_2;
	/* Initialize the FirstBit member */
	InitStruct.FirstBit = SPI_FirstBit_MSB;
	/* Initialize the CRCPolynomial member */
	InitStruct.CRCPolynomial = 7;
}

/**
  * @brief  Fills each I2S_InitStruct member with its default value.
  * @param  I2S_InitStruct : pointer to a I2S_InitTypeDef structure which will be initialized.
  * @retval None
  */
void I2S::StructInit(InitTypeDef &InitStruct)
{
	/*--------------- Reset I2S init structure parameters values -----------------*/
	/* Initialize the Mode member */
	InitStruct.Mode = I2S_Mode_SlaveTx;

	/* Initialize the Standard member */
	InitStruct.Standard = I2S_Standard_Phillips;

	/* Initialize the DataFormat member */
	InitStruct.DataFormat = I2S_DataFormat_16b;

	/* Initialize the MCLKOutput member */
	InitStruct.MCLKOutput = I2S_MCLKOutput_Disable;

	/* Initialize the AudioFreq member */
	InitStruct.AudioFreq = I2S_AudioFreq_Default;

	/* Initialize the CPOL member */
	InitStruct.CPOL = I2S_CPOL_Low;
}

/**
  * @brief  Enables or disables the specified SPI peripheral.
  * @param  SPIx: where x can be 1, 2 or 3 to select the SPI peripheral.
  * @param  NewState: new state of the SPIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SPI::Cmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_SPI_ALL_PERIPH(SPIx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected SPI peripheral */
		SPIx->CR1 |= CR1_SPE_Set;
	}
	else
	{
		/* Disable the selected SPI peripheral */
		SPIx->CR1 &= CR1_SPE_Reset;
	}
}

/**
  * @brief  Enables or disables the specified SPI peripheral (in I2S mode).
  * @param  SPIx: where x can be 2 or 3 to select the SPI peripheral.
  * @param  NewState: new state of the SPIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2S::Cmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_SPI_23_PERIPH(SPIx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected SPI peripheral (in I2S mode) */
		SPIx->I2SCFGR |= I2SCFGR_I2SE_Set;
	}
	else
	{
		/* Disable the selected SPI peripheral (in I2S mode) */
		SPIx->I2SCFGR &= I2SCFGR_I2SE_Reset;
	}
}

/**
  * @brief  Enables or disables the specified SPI/I2S interrupts.
  * @param  SPIx: where x can be
  *   - 1, 2 or 3 in SPI mode
  *   - 2 or 3 in I2S mode
  * @param  SPI_I2S_IT: specifies the SPI/I2S interrupt source to be enabled or disabled.
  *   This parameter can be one of the following values:
  *     @arg SPI_I2S_IT_TXE: Tx buffer empty interrupt mask
  *     @arg SPI_I2S_IT_RXNE: Rx buffer not empty interrupt mask
  *     @arg SPI_I2S_IT_ERR: Error interrupt mask
  * @param  NewState: new state of the specified SPI/I2S interrupt.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SPI_I2S_Base::ITConfig(uint8_t SPI_I2S_IT, FunctionalState NewState)
{
	uint16_t itpos = 0, itmask = 0 ;
	/* Check the parameters */
	assert_param(IS_SPI_ALL_PERIPH(SPIx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	assert_param(IS_SPI_I2S_CONFIG_IT(SPI_I2S_IT));

	/* Get the SPI/I2S IT index */
	itpos = SPI_I2S_IT >> 4;

	/* Set the IT mask */
	itmask = (uint16_t)1 << (uint16_t)itpos;

	if(NewState != DISABLE)
	{
		/* Enable the selected SPI/I2S interrupt */
		SPIx->CR2 |= itmask;
	}
	else
	{
		/* Disable the selected SPI/I2S interrupt */
		SPIx->CR2 &= (uint16_t)~itmask;
	}
}

/**
  * @brief  Enables or disables the SPIx/I2Sx DMA interface.
  * @param  SPIx: where x can be
  *   - 1, 2 or 3 in SPI mode
  *   - 2 or 3 in I2S mode
  * @param  SPI_I2S_DMAReq: specifies the SPI/I2S DMA transfer request to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg SPI_I2S_DMAReq_Tx: Tx buffer DMA transfer request
  *     @arg SPI_I2S_DMAReq_Rx: Rx buffer DMA transfer request
  * @param  NewState: new state of the selected SPI/I2S DMA transfer request.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SPI_I2S_Base::DMACmd(uint16_t SPI_I2S_DMAReq, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_SPI_ALL_PERIPH(SPIx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	assert_param(IS_SPI_I2S_DMAREQ(SPI_I2S_DMAReq));
	if(NewState != DISABLE)
	{
		/* Enable the selected SPI/I2S DMA requests */
		SPIx->CR2 |= SPI_I2S_DMAReq;
	}
	else
	{
		/* Disable the selected SPI/I2S DMA requests */
		SPIx->CR2 &= (uint16_t)~SPI_I2S_DMAReq;
	}
}

/**
  * @brief  Transmits a Data through the SPIx/I2Sx peripheral.
  * @param  SPIx: where x can be
  *   - 1, 2 or 3 in SPI mode
  *   - 2 or 3 in I2S mode
  * @param  Data : Data to be transmitted.
  * @retval None
  */
void SPI_I2S_Base::SendData(uint16_t Data)
{
	/* Check the parameters */
	assert_param(IS_SPI_ALL_PERIPH(SPIx));

