ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_spi.cpp
	/* Get the SPI/I2S IT mask */
	itmask = SPI_I2S_IT >> 4;

	/* Set the IT mask */
	itmask = 0x01 << itmask;

	/* Get the SPI_I2S_IT enable bit status */
	enablestatus = (SPIx->CR2 & itmask) ;

	/* Check the status of the specified SPI/I2S interrupt */
	if(((SPIx->SR & itpos) != (uint16_t)RESET) && enablestatus)
	{
		/* SPI_I2S_IT is set */
		bitstatus = SET;
	}
	else
	{
		/* SPI_I2S_IT is reset */
		bitstatus = RESET;
	}
	/* Return the SPI_I2S_IT status */
	return bitstatus;
}

/**
  * @brief  Clears the SPIx CRC Error (CRCERR) interrupt pending bit.
  * @param  SPIx: where x can be
  *   - 1, 2 or 3 in SPI mode
  * @param  SPI_I2S_IT: specifies the SPI interrupt pending bit to clear.
  *   This function clears only CRCERR interrupt pending bit.
  * @note
  *   - OVR (OverRun Error) interrupt pending bit is cleared by software
  *     sequence: a read operation to SPI_DR register (SPI_I2S_ReceiveData())
  *     followed by a read operation to SPI_SR register (SPI_I2S_GetITStatus()).
  *   - UDR (UnderRun Error) interrupt pending bit is cleared by a read
  *     operation to SPI_SR register (SPI_I2S_GetITStatus()).
  *   - MODF (Mode Fault) interrupt pending bit is cleared by software sequence:
  *     a read/write operation to SPI_SR register (SPI_I2S_GetITStatus())
  *     followed by a write operation to SPI_CR1 register (SPI_Cmd() to enable
  *     the SPI).
  * @retval None
  */
void SPI_I2S_Base::ClearITPendingBit(uint8_t SPI_I2S_IT)
{
	uint16_t itpos = 0;
	/* Check the parameters */
	assert_param(IS_SPI_ALL_PERIPH(SPIx));
	assert_param(IS_SPI_I2S_CLEAR_IT(SPI_I2S_IT));

	/* Get the SPI IT index */
	itpos = 0x01 << (SPI_I2S_IT & 0x0F);

	/* Clear the selected SPI CRC Error (CRCERR) interrupt pending bit */
	SPIx->SR = (uint16_t)~itpos;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
